In [4]:
import pandas as pd

In [5]:
df1 = pd.read_csv("PandasYouTubeSeries/LOTR.csv")
df1

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [6]:
df2 = pd.read_csv("PandasYouTubeSeries/LOTR 2.csv")
df2

   FellowshipID FirstName   Age
0          1001     Frodo    50
1          1002   Samwise    39
2          1006   Legolas  2931
3          1007    Elrond  6520
4          1008  Barromir    51

In [7]:
df1.merge(df2)

   FellowshipID FirstName     Skills  Age
0          1001     Frodo     Hiding   50
1          1002   Samwise  Gardening   39

In [13]:
df1.merge(df2, how = "inner", on = ["FellowshipID"], suffixes=["_1", "_2"])

   FellowshipID FirstName_1     Skills FirstName_2  Age
0          1001       Frodo     Hiding       Frodo   50
1          1002     Samwise  Gardening     Samwise   39

In [16]:
df1.merge(df2, how="outer")

   FellowshipID FirstName     Skills     Age
0          1001     Frodo     Hiding    50.0
1          1002   Samwise  Gardening    39.0
2          1003   Gandalf     Spells     NaN
3          1004    Pippin  Fireworks     NaN
4          1006   Legolas        NaN  2931.0
5          1007    Elrond        NaN  6520.0
6          1008  Barromir        NaN    51.0

In [17]:
df1.merge(df2, how="left")

   FellowshipID FirstName     Skills   Age
0          1001     Frodo     Hiding  50.0
1          1002   Samwise  Gardening  39.0
2          1003   Gandalf     Spells   NaN
3          1004    Pippin  Fireworks   NaN

In [18]:
df1.merge(df2, how="cross")

    FellowshipID_x FirstName_x     Skills  FellowshipID_y FirstName_y   Age
0             1001       Frodo     Hiding            1001       Frodo    50
1             1001       Frodo     Hiding            1002     Samwise    39
2             1001       Frodo     Hiding            1006     Legolas  2931
3             1001       Frodo     Hiding            1007      Elrond  6520
4             1001       Frodo     Hiding            1008    Barromir    51
5             1002     Samwise  Gardening            1001       Frodo    50
6             1002     Samwise  Gardening            1002     Samwise    39
7             1002     Samwise  Gardening            1006     Legolas  2931
8             1002     Samwise  Gardening            1007      Elrond  6520
9             1002     Samwise  Gardening            1008    Barromir    51
10            1003     Gandalf     Spells            1001       Frodo    50
11            1003     Gandalf     Spells            1002     Samwise    39
12            1003     Gandalf     Spells            1006     Legolas  2931
13            1003     Gandalf     Spells            1007      Elrond  6520
14            1003     Gandalf     Spells            1008    Barromir    51
15            1004      Pippin  Fireworks            1001       Frodo    50
16            1004      Pippin  Fireworks            1002     Samwise    39
17            1004      Pippin  Fireworks            1006     Legolas  2931
18            1004      Pippin  Fireworks            1007      Elrond  6520
19            1004      Pippin  Fireworks            1008    Barromir    51

In [19]:
df2

   FellowshipID FirstName   Age
0          1001     Frodo    50
1          1002   Samwise    39
2          1006   Legolas  2931
3          1007    Elrond  6520
4          1008  Barromir    51

In [20]:
df1

   FellowshipID FirstName     Skills
0          1001     Frodo     Hiding
1          1002   Samwise  Gardening
2          1003   Gandalf     Spells
3          1004    Pippin  Fireworks

In [22]:
df1.join(df2, on = "FellowshipID", how = "outer", lsuffix="_left", rsuffix="_right")

,FellowshipID,FellowshipID_left,FirstName_left,Skills,FellowshipID_right,FirstName_right,Age
NaN,0,NaN,NaN,NaN,1001.0,Frodo,50.0
NaN,1,NaN,NaN,NaN,1002.0,Samwise,39.0
NaN,2,NaN,NaN,NaN,1006.0,Legolas,2931.0
NaN,3,NaN,NaN,NaN,1007.0,Elrond,6520.0
NaN,4,NaN,NaN,NaN,1008.0,Barromir,51.0
0.0,1001,1001.0,Frodo,Hiding,NaN,NaN,NaN
1.0,1002,1002.0,Samwise,Gardening,NaN,NaN,NaN
2.0,1003,1003.0,Gandalf,Spells,NaN,NaN,NaN
3.0,1004,1004.0,Pippin,Fireworks,NaN,NaN,NaN

In [23]:
df = pd.read_csv(
    'https://raw.githubusercontent.com/kimfetti/Videos/master/Pandas_Tips/data/pet_data.csv'
)

In [24]:
df.head()

      name pet_type   food_type amount    brand
0    Simba   Lizard     Insects   212g      NaN
1  Winston   Ferret    Dry Food    NaN  Pawsome
2    Bella   Parrot       Seeds    NaN      NaN
3   Shadow  Hamster     Pellets    58g      NaN
4     Milo   Rabbit  Vegetables   124g      NaN

In [25]:
df.dropna(how = "all", inplace = True)
df.shape

(496, 5)

In [28]:
df[df.duplicated(keep=False)]

       name    pet_type food_type amount brand
28   Cooper  Guinea Pig   Pellets    NaN   NaN
95     Luna         Cat       NaN    NaN   NaN
144   Rocky        Fish   Pellets    NaN   NaN
152  Stella       Snake       NaN    NaN   NaN
242  Cooper  Guinea Pig   Pellets    NaN   NaN
275   Rocky        Fish   Pellets    NaN   NaN
323  Stella       Snake       NaN    NaN   NaN
485    Luna         Cat       NaN    NaN   NaN

In [30]:
no_dupes = df.drop_duplicates()

In [32]:
no_dupes.shape

(492, 5)

In [33]:
no_dupes[no_dupes.duplicated()]

Empty DataFrame
Columns: [name, pet_type, food_type, amount, brand]
Index: []

In [36]:
df.name.value_counts()

name
Charlie    18
Luna       18
Lucy       16
Oliver     15
Lily       15
Lola       14
Cooper     14
Oscar      14
Chloe      14
Winston    13
Sophie     13
Stella     13
Finn       13
Shadow     13
Mocha      13
Zoe        12
Nala       12
Riley      12
Kitty      12
Loki       12
Harley     11
Jasper     11
Coco       11
Buddy      10
Duke       10
Sadie      10
Tiger      10
Ruby        9
Simba       9
Lulu        9
Penny       9
Leo         9
Zeus        9
Mittens     9
Milo        9
Rocky       8
Tucker      7
Max         7
Molly       7
Casper      7
Bailey      7
Gizmo       6
Cleo        6
Rosie       5
Bella       5
Daisy       5
Name: count, dtype: int64

In [40]:
df.drop_duplicates(subset="name").name.value_counts()

name
Simba      1
Loki       1
Rocky      1
Penny      1
Chloe      1
Buddy      1
Nala       1
Kitty      1
Ruby       1
Stella     1
Sadie      1
Luna       1
Winston    1
Molly      1
Lola       1
Finn       1
Oliver     1
Oscar      1
Bailey     1
Riley      1
Mocha      1
Daisy      1
Coco       1
Lulu       1
Tucker     1
Cooper     1
Bella      1
Shadow     1
Milo       1
Zoe        1
Casper     1
Gizmo      1
Lily       1
Tiger      1
Mittens    1
Zeus       1
Leo        1
Lucy       1
Rosie      1
Charlie    1
Harley     1
Jasper     1
Sophie     1
Max        1
Duke       1
Cleo       1
Name: count, dtype: int64

In [48]:
df.drop_duplicates(subset=["name", "pet_type"])[["name", "pet_type"]].value_counts()

name    pet_type
Bailey  Bird          1
Oscar   Lizard        1
Penny   Guinea Pig    1
        Fish          1
        Ferret        1
                     ..
Leo     Fish          1
        Ferret        1
        Cat           1
Kitty   Turtle        1
Zoe     Turtle        1
Name: count, Length: 319, dtype: int64

In [56]:
df.drop_duplicates(subset=["pet_type"])["pet_type"].dropna()

0         Lizard
1         Ferret
2         Parrot
3        Hamster
4         Rabbit
9           Fish
10           Cat
11           Dog
22         Snake
28    Guinea Pig
34        Turtle
65          Bird
Name: pet_type, dtype: object

In [60]:
df.drop_duplicates(subset="name", keep="last")

        name    pet_type   food_type amount          brand
313   Tucker         Cat  Dry Kibble    NaN            NaN
338     Milo      Rabbit         NaN    NaN            NaN
344     Zeus         Dog    Wet Food   147g            NaN
360     Lulu      Turtle     Pellets   143g            NaN
382      Leo        Fish     Pellets    66g            NaN
405    Rosie  Guinea Pig  Vegetables    96g            NaN
415    Daisy        Fish      Flakes    NaN      SnackLand
418    Molly      Parrot       Seeds   243g            NaN
422     Duke      Parrot         NaN    NaN            NaN
429      Zoe     Hamster       Seeds   190g            NaN
431   Stella      Parrot     Pellets   189g            NaN
434  Mittens        Bird      Fruits    72g            NaN
436    Simba     Hamster       Seeds   182g  TropicalFeast
437    Penny         Cat    Wet Food    NaN            NaN
438  Winston     Hamster       Seeds   178g            NaN
439    Buddy      Rabbit         NaN   179g            NaN
444      Max        Fish     Pellets   116g            NaN
448    Riley        Bird      Fruits    47g            NaN
450    Gizmo       Snake        Eggs    NaN            NaN
451   Cooper      Rabbit         Hay    56g            NaN
452   Oliver      Turtle  Vegetables   134g            NaN
458   Bailey      Lizard     Pellets    44g            NaN
461     Lucy       Snake        Eggs    74g            NaN
462    Oscar      Turtle     Pellets   117g            NaN
464    Tiger      Parrot       Seeds   166g   GreenHarvest
468   Harley        Fish      Flakes   201g            NaN
470    Chloe         Cat    Wet Food    NaN   YummyDelight
471     Lily      Rabbit         Hay    NaN            NaN
472     Ruby      Ferret    Dry Food   206g            NaN
474    Sadie      Rabbit  Vegetables   125g            NaN
477   Sophie      Parrot     Pellets    76g            NaN
478    Bella      Parrot     Pellets   231g            NaN
480     Coco      Turtle     Pellets   149g            NaN
481   Casper        Bird       Seeds    52g            NaN
483  Charlie      Parrot       Seeds   223g  PetPerfection
484   Jasper      Parrot         NaN   107g            NaN
487    Kitty       Snake        Eggs    NaN            NaN
488     Lola        Fish     Pellets   167g            NaN
489    Rocky      Lizard     Insects   135g       ChowTime
490     Loki  Guinea Pig         NaN   207g            NaN
491    Mocha      Turtle     Pellets   249g            NaN
492     Luna      Lizard     Pellets   223g  PetPerfection
494      NaN      Turtle     Pellets   162g            NaN
495   Shadow         Dog    Wet Food   229g  TropicalFeast
496     Nala       Snake        Eggs   114g            NaN
498     Finn     Hamster       Seeds    55g            NaN
499     Cleo      Parrot     Pellets   117g            NaN